const jokes = [
    "Why was the math book sad? Because it had too many problems. 😆🤣😋😉 ",
    "Why did the cookie go to the doctor? Because it was feeling crumbly.😆🤣😋😉 ",
    "आओ 2 Min मौन रखे उन लड़कियों के लिए.. जिनकी शक्ल Nokia 1100 जैसी है और घमंड Iphone14 जैसा…. 😆🤣😋😉 ",
    "एक लड़का एक सुंदर लड़की को बड़ी देर से घूर रहा था. लड़की (गुस्से में): क्या देख रहे हो? लड़का (हड़बड़ी में): देख रहा हूँ कि अगर तुम मेरी अम्मा होती तो मैं भी सुन्दर होता..!😆🤣😋😉 ",
    "भिखारी : ऐ भाई एक रुपया देदे, तिन दिन से भूखा हूँ। राहगीर : तिन दिन से भूखा है तो एक रुपए का क्या करेगा..? भिखारी : वजन तोलूंगा कितना घटा है|😆🤣😋😉 ",
    "दुनिया चांद पर पहुंच गयी,और तू यहीं पर बैठा है|पप्पू ने अपना दिमाग लगाया और नीचे लिखा: चांद पर पानी नहीं था , इसलिए वापस आ गया.😆🤣😋😉 ",
    "पप्पू अपनी पत्नी से: अच्छा ये बताओ 'बिदाई' के समय तुम लड़कियां इतनी रोती क्यों हो? पत्नी: 'पागल' अगर तुझे पता चले...अपने घर से दूर ले जाकर कोई तुमसे 'बर्तन मंजवाएगा' तो तू क्या नाचेगा...😆🤣😋😉 ",
    "टीचर: इतने दिन कहां थे, स्कूल क्यों नहीं आए ? गोलू: बर्ड फ्लू हो गया था मैम। टीचर: पर ये तो पक्षियों को होता है इंसानों को नहीं। गोलू: इंसान समझा ही कहां आपने,रोज तो मुर्गा बना देती हो.😆🤣😋😉 "
];
  
  function generateJoke() {
    const randomNumber = Math.floor(Math.random() * jokes.length);
    document.getElementById("joke").innerHTML = jokes[randomNumber];
  }